{
     "1.1.0" : {
          "description" : "<ul><li>Tweak - Add order note about cause of problem when order is created via checkout error flow.</li><li>Tweak - Moved unsetting of sessions to wc_ecster_unset_sessions() function.</li><li>* Tweak - Defaulting countryCode and defaultDeliveryCountry to wc base location (if not set by customer).</li><li>Fix - Fixed double order problem in checkout error flow.</li></ul>",
          "requires" : "4.7.0",
          "tested" : "5.4"
     },
     "1.1.1" : {
          "description" : "<ul><li>Tweak - Updated a couple of strings in Swedish translation.</li><li>Fix - Don't run Ecster js scripts on thank you page. Could cause a new session request to Ecster.</li><li>Fix - Don't try to create order in Woo on backup order creation callback if the callback data contain info regarding a failed payment.</li></ul>",
          "requires" : "4.7.0",
          "tested" : "5.4"
     },
     "2.0.0" : {
          "description" : "<ul><li>Tweak - Major version bump to easier be able to distinguish between EP1 & EP2.</li><li>Tweak - Added plugin version to header in requests sent to Ecster.</li><li>Tweak - Save _wc_ecster_payment_method order post meta in regular checkout flow.</li><li>Fix - Save phone number and email in order if it hasen't been saved during regular checkout form submission.</li><li>Fix - Set correct payment method in backup order creation flow.</li><li>Fix - Fixed bug in WC_Ecster_Request_Update_Reference request in backup order creation flow.</li><li>Fix - Set correct Ecster payment method name and save _transaction_id in submission error (checkout_error) sequence.</li></ul>",
          "requires" : "4.7.0",
          "tested" : "5.4.1"
     },
     "2.0.1" : {
          "description" : "<ul><li>Tweak - Improved displaying of error message in checkout if wrong API keys are entered in settings.</li><li>Fix - Remove current Ecster session and create a new if it has expired. Avoids eternal Ecster spinner in checkout.</li><li>Fix - Change vatRate for fees to work with new API.</li><li>Fix - Rounding fix in fee amount and cart total amount.</li></ul>",
          "requires" : "4.7.0",
          "tested" : "5.4.1"
     },
     "2.0.2" : {
          "description" : "<ul><li>Tweak - Move Select another payment method button to above iframe. Render it via template hook instead of via JS.</li><li>Fix - Save company name correct in WooCommerce order for B2B purchases.</li></ul>",
          "requires" : "4.7.0",
          "tested" : "5.4.1"
     },
     "2.0.3" : {
          "description" : "<ul><li>Tweak - Check if Ecster reference already exist in order before processing/creating Woo order.</li><li>Tweak - Adds CSS class processing when submitting Woo form to avoid double posting.</li><li>Fix - Save Ecster reference as _transaction_id in backup order creation.</li></ul>",
          "requires" : "4.7.0",
          "tested" : "5.4.2"
     },
     "2.0.4" : {
          "description" : "<ul><li>Fix - Escape \" characters in cart/order data sent to Ecster. Caused Ecster checkout to fail.</li><li>Fix - Only create WC order via fallback order creation sequence if Ecster order status is READY or FULLY_DELIVERED.</li></ul>",
          "requires" : "4.7.0",
          "tested" : "5.4.2"
     },
     "2.0.5" : {
          "description" : "<ul><li>Fix - Don't trigger payment method change function during Woo form submission/order creation process. Could cause conflict with other plugins and prevent user from being redirected to thank uou page.</li><li>Fix - Don't trigger wc_ecster_on_checkout_start_failure function during Woo form submission/order creation process.</li></ul>",
          "requires" : "4.7.0",
          "tested" : "5.4.2"
     },
     "2.0.6" : {
          "description" : "<ul><li>Tweak - Changed CSS to B2B/B2C selector. Could be displayed on two rows with certain themes.</li></ul>",
          "requires" : "4.7.0",
          "tested" : "5.5"
     },
     "2.0.7" : {
          "description" : "<ul><li>Fix - Avoid division by zero PHP warning in calculating line item tax.</li></ul>",
          "requires" : "4.7.0",
          "tested" : "5.5"
     },
     "2.1.0" : {
          "description" : "<ul><li>Tweak - Add shipping fee to WooCommerce order during backup order creation process.</li><li>Tweak - Use WooCommerce Action scheduler fow scheduling OSN callback jobs.</li></ul>",
          "requires" : "4.7.0",
          "tested" : "5.5.1"
     },
     "2.2.0" : {
          "description" : "<ul><li>Tweak - Display order comment field in Ecster Pay checkout template.</li><li>Fix - Refresh checkout page when adding a coupon that result in 0 order value to swithch from Ecster checkout template to standrard Woo template.</li><li>Fix - Add shipping fee to WooCommerce order during backup order creation process - even when the shipping is named in Swedish.</li></ul>",
          "requires" : "4.7.0",
          "tested" : "5.5.1"
     },
     "3.0.0" : {
          "description" : "<ul><li>Feature - Plugin rewrite. Plugin now supports Ecsters front end validation JS event. WooCommerce order is created (as a Pending order) when customer clicks purchase button in Ecster.</li><li>Feature - Add support for handling extra checkout fields in checkout.</li><li>Tweak - Added temp order id to solve callbacks until order is created in both systems.</li><li>Tweak - Added separate confirmation class.</li><li>Tweak - Removed unused css.</li><li>Tweak - JS checkout file refactoring.</li><li>Tweak - Remove hooks ecster_wc_before_checkout_form & ecster_wc_after_checkout_form.</li><li>Tweak - Add hooks woocommerce_before_checkout_form & woocommerce_after_checkout_form.</li><li>Tweak - Add js front end logging via ajax.</li><li>Tweak - Set customer email and phone in WC order during confirmation.</li><li>Tweak - Swedish translation update.</li><li>Fix - Don't try to cancel an order in Ecster if it hasn't been paid for.</li><li>Fix - Change query to look for orders in Woo (during API callback) up to 120 days back. Could cause creation of orders in Woo.</li></ul>",
          "requires" : "4.7.0",
          "tested" : "5.6.1"
     }
}